<?php

/**
 * Сообщения лога
 * Запись сообщений лога осуществляется вызовом одного из следующих методов:
 *
 * Yii::trace(): записывает сообщения для отслеживания выполнения кода приложения. Используется, в основном, при разработке.
 * Yii::info(): записывает сообщение, содержащее какую-либо полезную информацию.
 * Yii::warning(): записывает тревожное сообщение при возникновении неожиданного события.
 * Yii::error(): записывает критическую ошибку, на которую нужно, как можно скорее, обратить внимаение.
 *
 **/